balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ192GB106.PIC
              <edc:DCRFieldSemantic edc:cname="WPFP100" edc:desc="Page 100 (0x19000)" edc:when="(field &amp; 0x1ff) == 0x064"/>
              <edc:DCRFieldSemantic edc:cname="WPFP101" edc:desc="Page 101 (0x19400)" edc:when="(field &amp; 0x1ff) == 0x065"/>
              <edc:DCRFieldSemantic edc:cname="WPFP102" edc:desc="Page 102 (0x19800)" edc:when="(field &amp; 0x1ff) == 0x066"/>
              <edc:DCRFieldSemantic edc:cname="WPFP103" edc:desc="Page 103 (0x19C00)" edc:when="(field &amp; 0x1ff) == 0x067"/>
              <edc:DCRFieldSemantic edc:cname="WPFP104" edc:desc="Page 104 (0x1A000)" edc:when="(field &amp; 0x1ff) == 0x068"/>
              <edc:DCRFieldSemantic edc:cname="WPFP105" edc:desc="Page 105 (0x1A400)" edc:when="(field &amp; 0x1ff) == 0x069"/>
              <edc:DCRFieldSemantic edc:cname="WPFP106" edc:desc="Page 106 (0x1A800)" edc:when="(field &amp; 0x1ff) == 0x06A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP107" edc:desc="Page 107 (0x1AC00)" edc:when="(field &amp; 0x1ff) == 0x06B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP108" edc:desc="Page 108 (0x1B000)" edc:when="(field &amp; 0x1ff) == 0x06C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP109" edc:desc="Page 109 (0x1B400)" edc:when="(field &amp; 0x1ff) == 0x06D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP110" edc:desc="Page 110 (0x1B800)" edc:when="(field &amp; 0x1ff) == 0x06E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP111" edc:desc="Page 111 (0x1BC00)" edc:when="(field &amp; 0x1ff) == 0x06F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP112" edc:desc="Page 112 (0x1C000)" edc:when="(field &amp; 0x1ff) == 0x070"/>
              <edc:DCRFieldSemantic edc:cname="WPFP113" edc:desc="Page 113 (0x1C400)" edc:when="(field &amp; 0x1ff) == 0x071"/>
              <edc:DCRFieldSemantic edc:cname="WPFP114" edc:desc="Page 114 (0x1C800)" edc:when="(field &amp; 0x1ff) == 0x072"/>
              <edc:DCRFieldSemantic edc:cname="WPFP115" edc:desc="Page 115 (0x1CC00)" edc:when="(field &amp; 0x1ff) == 0x073"/>
              <edc:DCRFieldSemantic edc:cname="WPFP116" edc:desc="Page 116 (0x1D000)" edc:when="(field &amp; 0x1ff) == 0x074"/>
              <edc:DCRFieldSemantic edc:cname="WPFP117" edc:desc="Page 117 (0x1D400)" edc:when="(field &amp; 0x1ff) == 0x075"/>
              <edc:DCRFieldSemantic edc:cname="WPFP118" edc:desc="Page 118 (0x1D800)" edc:when="(field &amp; 0x1ff) == 0x076"/>
              <edc:DCRFieldSemantic edc:cname="WPFP119" edc:desc="Page 119 (0x1DC00)" edc:when="(field &amp; 0x1ff) == 0x077"/>
              <edc:DCRFieldSemantic edc:cname="WPFP120" edc:desc="Page 120 (0x1E000)" edc:when="(field &amp; 0x1ff) == 0x078"/>
              <edc:DCRFieldSemantic edc:cname="WPFP121" edc:desc="Page 121 (0x1E400)" edc:when="(field &amp; 0x1ff) == 0x079"/>
              <edc:DCRFieldSemantic edc:cname="WPFP122" edc:desc="Page 122 (0x1E800)" edc:when="(field &amp; 0x1ff) == 0x07A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP123" edc:desc="Page 123 (0x1EC00)" edc:when="(field &amp; 0x1ff) == 0x07B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP124" edc:desc="Page 124 (0x1F000)" edc:when="(field &amp; 0x1ff) == 0x07C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP125" edc:desc="Page 125 (0x1F400)" edc:when="(field &amp; 0x1ff) == 0x07D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP126" edc:desc="Page 126 (0x1F800)" edc:when="(field &amp; 0x1ff) == 0x07E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP127" edc:desc="Page 127 (0x1FC00)" edc:when="(field &amp; 0x1ff) == 0x07F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP128" edc:desc="Page 128 (0x20000)" edc:when="(field &amp; 0x1ff) == 0x080"/>
              <edc:DCRFieldSemantic edc:cname="WPFP129" edc:desc="Page 129 (0x20400)" edc:when="(field &amp; 0x1ff) == 0x081"/>
              <edc:DCRFieldSemantic edc:cname="WPFP130" edc:desc="Page 130 (0x20800)" edc:when="(field &amp; 0x1ff) == 0x082"/>
              <edc:DCRFieldSemantic edc:cname="WPFP511" edc:desc="Highest Page (same as page 130)" edc:when="(field &amp; 0x1ff) == 0x1ff"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES1" edc:desc="Reserved" edc:ishidden="true" edc:islanghidden="true" edc:mask="0xf" edc:name="RES1" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPDIS" edc:desc="Segment Write Protection Disable bit" edc:mask="0x1" edc:name="WPDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPDIS" edc:desc="Segmented code protection disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPEN" edc:desc="Segmented code protection enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPCFG" edc:desc="Configuration Word Code Page Protection Select bit" edc:mask="0x1" edc:name="WPCFG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPCFGDIS" edc:desc="Last page(at the top of program memory) and Flash configuration words are not protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPCFGEN" edc:desc="Last page and Flash configuration words are code-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPEND" edc:desc="Segment Write Protection End Page Select bit" edc:mask="0x1" edc:name="WPEND" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPENDMEM" edc:desc="Write Protect from WPFP to the last page of memory" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPSTARTMEM" edc:desc="Write Protect from page 0 to WPFP" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnrnnnnnnnnrnn" edc:cname="CONFIG2" edc:default="0xf7ff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG2" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf7ff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="POSCMOD" edc:desc="Primary Oscillator Select" edc:mask="0x3" edc:name="POSCMOD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Primary oscillator disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator mode selected" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT oscillator mode selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC oscillator mode selected" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="I2C2SEL" edc:desc="I2C2 Pin Select bit" edc:ishidden="true" edc:mask="0x1" edc:name="I2C2SEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Use Default SCL2/SDA2 pins for I2C2" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SEC" edc:desc="Use alternate ASCL2/ASDA2 pins for I2C2" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DISUVREG" edc:desc="Internal USB 3.3V Regulator Disable bit" edc:mask="0x1" edc:name="DISUVREG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Regulator is disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Regulator is enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="IOLOCK One-Way Set Enable bit" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Unlimited Writes To RP Registers" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Write RP Registers Once" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="Primary Oscillator Output Function" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="OSCO functions as port I/O (RC15)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="OSCO functions as CLKO (FOSC/2)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Monitor" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Both Clock Switching and Fail-safe Clock Monitor are disabled" edc:when="(field &amp; 0x2) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock switching is enabled, Fail-safe Clock Monitor is disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Both Clock switching and Fail-safe Clock Monitor are enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Select" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="FRCDIV" edc:desc="Fast RC oscillator with Postscaler (FRCDIV)" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low-Power RC oscillator (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary oscillator (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PRIPLL" edc:desc="Primary oscillator (XT, HS, EC) with PLL module (XTPLL,HSPLL, ECPLL)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary oscillator (XT, HS, EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="FRCPLL" edc:desc="Fast RC oscillator with Postscaler and PLL module (FRCPLL)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Fast RC Oscillator (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PLL_96MHZ" edc:desc="96MHz PLL Disable" edc:mask="0x1" edc:name="PLL_96MHZ" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PLLDIV" edc:desc="USB 96 MHz PLL Prescaler Select bits" edc:mask="0x7" edc:name="PLLDIV" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="DIV12" edc:desc="Oscillator input divided by 12 (48MHz input)" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DIV10" edc:desc="Oscillator input divided by 10 (40MHz input)" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DIV6" edc:desc="Oscillator input divided by 6 (24MHz input)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DIV5" edc:desc="Oscillator input divided by 5 (20MHz input)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV4" edc:desc="Oscillator input divided by 4 (16MHz input)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV3" edc:desc="Oscillator input divided by 3 (12MHz input)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV2" edc:desc="Oscillator input divided by 2 (8MHz input)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="NODIV" edc:desc="Oscillator input used directly (4MHz input)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal External Switch Over Mode" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="IESO mode (Two-speed start-up)disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="IESO mode (Two-speed start-up) enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="rnnnnrnnnnnnnnnn" edc:cname="CONFIG1" edc:default="0x7fff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG1" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7bdf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Postscaler" edc:mask="0xf" edc:name="WDTPS" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32,768" edc:when="(field &amp; 0xf) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16,384" edc:when="(field &amp; 0xf) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8,192" edc:when="(field &amp; 0xf) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4,096" edc:when="(field &amp; 0xf) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2,048" edc:when="(field &amp; 0xf) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1,024" edc:when="(field &amp; 0xf) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0xf) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0xf) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0xf) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0xf) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0xf) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0xf) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0xf) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0xf) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0xf) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0xf) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWPSA" edc:desc="WDT Prescaler" edc:mask="0x1" edc:name="FWPSA" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="PR128" edc:desc="Prescaler ratio of 1:128" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PR32" edc:desc="Prescaler ratio of 1:32" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES0" edc:desc="Reserved" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="RES0" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Watchdog Timer Window" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Standard Watchdog Timer enabled,(Windowed-mode is disabled)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Windowed Watchdog Timer enabled; FWDTEN must be 1" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable" edc:mask="0x1" edc:name="FWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog Timer is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog Timer is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICS" edc:desc="Comm Channel Select" edc:mask="0x3" edc:name="ICS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="PGx3" edc:desc="Emulator functions are shared with PGEC3/PGED3" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PGx2" edc:desc="Emulator functions are shared with PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PGx1" edc:desc="Emulator functions are shared with PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="COE" edc:desc="Set Clip On Emulation Mode" edc:isidehidden="true" edc:mask="0x1" edc:name="COE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BKBUG" edc:desc="Background Debug" edc:isidehidden="true" edc:mask="0x1" edc:name="BKBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Device resets into Operational mode" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Device resets into Debug mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Code Segment Write Protect" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Writes to program memory are allowed" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Writes to program memory are disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GCP" edc:desc="General Code Segment Code Protect" edc:mask="0x1" edc:name="GCP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Code protection is disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Code protection is enabled for the entire program memory space" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x80" edc:endaddr="0x20bf8"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Port Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG port is enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG port is disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SIGN" edc:desc="Signature Bit" edc:ishidden="true" edc:islanghidden="true" edc:mask="0x1" edc:name="SIGN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Correct" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:WORMHoleSector>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8007c0" edc:beginaddr="0x800000" edc:endaddr="0x800800" edc:regionid="testmem"/>
    <edc:ConfigWORMSector edc:beginaddr="0xf80000" edc:endaddr="0xf80012" edc:regionid="cfgwormmem"/>
    <edc:DeviceIDSector edc:beginaddr="0xff0000" edc:endaddr="0xff0004" edc:mask="0xffff0000" edc:regionid="devid" edc:value="0x10110000"/>
    <edc:BACKBUGVectorSector edc:beginaddr="0x800000" edc:endaddr="0x800008" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:xbeginaddr="0x800" edc:xendaddr="0x4800">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:beginaddr="0x0" edc:endaddr="0x800" edc:regionid="sfrs">
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
